In [1]:
print('ABC')

ABC

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv('D:/python_files/customer_churn_prediction/data/raw/telco_customers.csv')

In [4]:
import os
print(os.getcwd())

d:\python_files\customer_churn_prediction\notebooks

In [5]:
df.columns
df.head()
df.info()
df.describe()
df.isnull().sum()
df.duplicated().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 21 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customerID        7043 non-null   object
 1   gender            7043 non-null   object
 2   SeniorCitizen     7043 non-null   int64
 3   Partner           7043 non-null   object
 4   Dependents        7043 non-null   object
 5   tenure            7043 non-null   int64
 6   PhoneService      7043 non-null   object
 7   MultipleLines     7043 non-null   object
 8   InternetService   7043 non-null   object
 9   OnlineSecurity    7043 non-null   object
 10  OnlineBackup      7043 non-null   object
 11  DeviceProtection  7043 non-null   object
 12  TechSupport       7043 non-null   object
 13  StreamingTV       7043 non-null   object
 14  StreamingMovies   7043 non-null   object
 15  Contract          7043 non-null   object
 16  PaperlessBilling  7043 non-null   object
 17  PaymentMethod     7043 non-null   object
 18  MonthlyCharges    7043 non-null   float64
 19  TotalCharges      7043 non-null   object
 20  Churn             7043 non-null   object
dtypes: float64(1), int64(2), object(18)
memory usage: 1.1+ MB

np.int64(0)

In [7]:
df[['SeniorCitizen', 'MonthlyCharges', 'tenure']]

      SeniorCitizen  MonthlyCharges  tenure
0                 0           29.85       1
1                 0           56.95      34
2                 0           53.85       2
3                 0           42.30      45
4                 0           70.70       2
...             ...             ...     ...
7038              0           84.80      24
7039              0          103.20      72
7040              0           29.60      11
7041              1           74.40       4
7042              0          105.65      66

[7043 rows x 3 columns]